#include <stdio.h>
/* Автор: MaxKonovalov38
   Задача: Напишите программу, которая выводит "Привет, мир!".*/

int main(void) {
	printf("Hello, World!\n");

	return 0;
}